<?php

use yii\db\Migration;

class m170903_121828_menu_vs_group extends Migration
{
public function safeUp()
    {
        $sql = "
            set foreign_key_checks=0;
          
           
            DROP TABLE IF EXISTS `menugroup`;
            CREATE TABLE `menugroup` (
              `id` int(11) NOT NULL AUTO_INCREMENT,
              `name` varchar(255) NOT NULL,
              `deleted` int(11) NOT NULL DEFAULT '0',
              `input_id` int(11)   DEFAULT NULL,
              `input_dt_stamp` DATETIME DEFAULT CURRENT_TIMESTAMP,
              PRIMARY KEY (`id`),          
              UNIQUE KEY `name_UNIQUE` (`name`),
              CONSTRAINT `fk_menugroup_user_id` FOREIGN KEY (`input_id`) REFERENCES `user` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION
            ) ENGINE=InnoDB  DEFAULT CHARSET=utf8;
            
                  
            INSERT INTO `menugroup` (`id`, `name`, `deleted`, `input_id`, `input_dt_stamp`) VALUES
            (1, 'ການຕັ້ງຄ່າ', 0, 1, '2017-09-03 17:19:01'),
            (2, 'ຜູ້ຄຸ້ມຄອງລະບົບນ', 0, 1, '2017-09-03 17:19:01');
            
           
            
            DROP TABLE IF EXISTS `menu`;
            CREATE TABLE `menu` (
              `id` int(11) NOT NULL AUTO_INCREMENT,
              `name` varchar(45) NOT NULL,
              `url` varchar(255) DEFAULT NULL,
              `description` varchar(255) DEFAULT NULL,
              `deleted` int(11) NOT NULL DEFAULT '0',
              `menugroup_id` int(11) DEFAULT NULL,
              `menu_parent_id` int(11) DEFAULT NULL,
              `input_id` int(11)   DEFAULT NULL,
              `input_dt_stamp` DATETIME DEFAULT CURRENT_TIMESTAMP,            
              PRIMARY KEY (`id`),
              KEY `fk_menu_menugroup1_idx` (`menugroup_id`),
              KEY `fk_menu_menu1_idx` (`menu_parent_id`),
              CONSTRAINT `fk_menu_user_id` FOREIGN KEY (`input_id`) REFERENCES `user` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION,
              CONSTRAINT `fk_menu_menu1` FOREIGN KEY (`menu_parent_id`) REFERENCES `menu` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION,
              CONSTRAINT `fk_menu_menugroup1` FOREIGN KEY (`menugroup_id`) REFERENCES `menugroup` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION
            ) ENGINE=InnoDB  DEFAULT CHARSET=utf8;
            
            
            
            INSERT INTO `menu` (`id`, `name`, `url`, `description`, `deleted`, `menugroup_id`, `menu_parent_id`, `input_id`, `input_dt_stamp`) VALUES
            (1, 'ກົມຈັດຕັ້ງ ແລະ ພະນັກງານ', NULL, 'ກົມຈັດຕັ້ງ ແລະ ພະນັກງານ', 0, NULL, 0, NULL, '2017-09-03 18:41:53'),
            (2, 'ຕາຕະລາງສັງລວມຈຳນວນລັດຖະກອນສຳລັບຊັ້ນ .... ເຖິງ', NULL, 'ຕາຕະລາງສັງລວມຈຳນວນລັດຖະກອນສຳລັບຊັ້ນ .... ເຖິງ ..... ແຍກຕາມຊັ້ນ-ຂັ້ນເງິນເດືອນ', 0, NULL, 1, NULL, '2017-09-03 18:45:05'),
            (3, 'ຕາຕະລາງສັງລວມຈຳນວນລັດຖະກອນແຍກຕາມຊັ້ນວິຊາສະເພາ', NULL, 'ຕາຕະລາງສັງລວມຈຳນວນລັດຖະກອນແຍກຕາມຊັ້ນວິຊາສະເພາະ', 0, NULL, 1, NULL, '2017-09-03 18:45:05'),
            (4, 'ຕາຕະລາງ ຈຳນວນລັດຖະກອນແຍກຕາມເກນອາຍຸ', NULL, 'ຕາຕະລາງ ຈຳນວນລັດຖະກອນແຍກຕາມເກນອາຍຸ', 0, NULL, 1, NULL, '2017-09-03 18:45:05'),
            (5, 'ຕາຕະລາງ ຈຳນວນລັດຖະກອນແຍກຕາມຊົນເຜົ່າ', NULL, 'ຕາຕະລາງ ຈຳນວນລັດຖະກອນແຍກຕາມຊົນເຜົ່າ', 0, NULL, 1, NULL, '2017-09-03 18:45:05'),
            (6, 'ຕາຕະລາງສັງລວມລັດຖະກອນຜູ້ທີ່ໄດ້ຮັບຕໍາແໜ່ງບໍລິຫ', NULL, 'ຕາຕະລາງສັງລວມລັດຖະກອນຜູ້ທີ່ໄດ້ຮັບຕໍາແໜ່ງບໍລິຫານປະເພດຕ່າງໆ', 0, NULL, 1, NULL, '2017-09-03 18:45:05'),
            (7, 'ຕາຕະລາງສັງລວມຈຳນວນລັດຖະກອນທີ່ເພີ່ມເຂົ້າໃນຮູບກ', NULL, 'ຕາຕະລາງສັງລວມຈຳນວນລັດຖະກອນທີ່ເພີ່ມເຂົ້າໃນຮູບການຕ່າງໆ', 0, NULL, 1, NULL, '2017-09-03 18:45:05'),
            (8, 'ຕາຕະລາງສັງລວມຈຳນວນລັດຖະກອນທີ່ອອກໃນຮູບການຕ່າງໆ', NULL, 'ຕາຕະລາງສັງລວມຈຳນວນລັດຖະກອນທີ່ອອກໃນຮູບການຕ່າງໆ', 0, NULL, 1, NULL, '2017-09-03 18:45:05'),
            (9, 'ຕາຕະລາງສັງລວມຈຳນວນພະນັກງານຕາມສັນຍາ', NULL, 'ຕາຕະລາງສັງລວມຈຳນວນພະນັກງານຕາມສັນຍາ', 0, NULL, 1, NULL, '2017-09-03 18:45:05'),
            (10, 'ຈໍານວນລັດຖະກອນທີ່ມີເງື່ອນໄຂຮັບບຳນານ', NULL, 'ຈໍານວນລັດຖະກອນທີ່ມີເງື່ອນໄຂຮັບບຳນານ', 0, NULL, 1, NULL, '2017-09-03 18:45:05'),
            (11, 'ຕາຕະລາງສັງລວມຊີວະປະຫວັດຫຍໍ້ຂອງພະນັກງານ', NULL, 'ຕາຕະລາງສັງລວມຊີວະປະຫວັດຫຍໍ້ຂອງພະນັກງານ', 0, NULL, 1, NULL, '2017-09-03 18:45:05'),
            (12, 'ຕາຕະລາງສັງລວມຈຳນວນພະນັກງານ (ສະເພາະຊັ້ນ VI) ແຍ', NULL, 'ຕາຕະລາງສັງລວມຈຳນວນພະນັກງານ (ສະເພາະຊັ້ນ VI) ແຍກຕາມຊັ້ນ-ຂັ້ນເງິນເດືອນ', 0, NULL, 1, NULL, '2017-09-03 18:45:06'),
            (13, 'ສະຖາບັນຄົ້ນຄວ້າວິທະຍາສາດການປົກຄອງ ແລະ ຝຶກອົບຮ', NULL, 'ສະຖາບັນຄົ້ນຄວ້າວິທະຍາສາດການປົກຄອງ ແລະ ຝຶກອົບຮົມ', 0, NULL, 0, NULL, '2017-09-03 18:45:38'),
            (14, 'ຕາຕະລາງສະຖິຕິສັງລວມການສ້າງ ແລະ ພັດທະນາຫຼັກສູດ', NULL, 'ຕາຕະລາງສະຖິຕິສັງລວມການສ້າງ ແລະ ພັດທະນາຫຼັກສູດ', 0, NULL, 13, NULL, '2017-09-03 18:47:12'),
            (15, 'ຕາຕະລາງສະຖິຕິການສະໜອງຫຼັກສູດໃຫ້ບັນດາພາກສ່ວນສູ', NULL, 'ຕາຕະລາງສະຖິຕິການສະໜອງຫຼັກສູດໃຫ້ບັນດາພາກສ່ວນສູນກາງ ແລະ ທ້ອງຖິ່ນ (ຕາມການສະເໜີ)', 0, NULL, 13, NULL, '2017-09-03 18:47:12'),
            (16, 'ຕາຕະລາງເກັບກຳສະຖິຕິການເຂົ້າຮ່ວມຊ່ວຍເປັນວິທະຍາ', NULL, 'ຕາຕະລາງເກັບກຳສະຖິຕິການເຂົ້າຮ່ວມຊ່ວຍເປັນວິທະຍາກອນຕາມການເຊື້ອເຊີນ', 0, NULL, 13, NULL, '2017-09-03 18:47:12'),
            (17, 'ຕາຕະລາງສະຖິຕິສັງລວມການຈັດກອງປະຊຸມ-ຝຶກອົບຮົມໃຫ', NULL, 'ຕາຕະລາງສະຖິຕິສັງລວມການຈັດກອງປະຊຸມ-ຝຶກອົບຮົມໃຫ້ບັນດາກະຊວງ-ອົງການຂັ້ນສູນກາງ ແລະ ທ້ອງຖິ່ນ', 0, NULL, 13, NULL, '2017-09-03 18:47:12'),
            (18, 'ສັງລວມສະຖິຕິສູນຄົ້ນຄວ້າວຽກງານການປົກຄອງ', NULL, 'ສັງລວມສະຖິຕິສູນຄົ້ນຄວ້າວຽກງານການປົກຄອງ', 0, NULL, 13, NULL, '2017-09-03 18:47:12'),
            (19, 'ຕາຕະລາງເກັບກຳສະຖິຕິການເຂົ້ານຳໃຊ້ປຶ້ມຕຳລາຫໍສະໝ', NULL, 'ຕາຕະລາງເກັບກຳສະຖິຕິການເຂົ້ານຳໃຊ້ປຶ້ມຕຳລາຫໍສະໝຸດ', 0, NULL, 13, NULL, '2017-09-03 18:47:12'),
            (20, 'ຕາຕະລາງສະຖິຕິສັງລວມການເຂົ້າຮ່ວມຝຶກອົບຮົມຂອງພະ', NULL, 'ຕາຕະລາງສະຖິຕິສັງລວມການເຂົ້າຮ່ວມຝຶກອົບຮົມຂອງພະນັກງານ-ລັດຖະກອນ ພາຍໃນສະຖາບັນ', 0, NULL, 13, NULL, '2017-09-03 18:47:13'),
            (21, 'ກົມວຽກງານຊົນເຜົ່າ ແລະ ສາສະໜາ', NULL, 'ກົມວຽກງານຊົນເຜົ່າ ແລະ ສາສະໜາ', 0, NULL, 0, NULL, '2017-09-03 18:47:24'),
            (22, 'ຕາຕະລາງເກັບກຳສະຖິຕິປະຊາຊົນເຊື່ອຖືສາສະໜາ ແລະ ຄ', NULL, 'ຕາຕະລາງເກັບກຳສະຖິຕິປະຊາຊົນເຊື່ອຖືສາສະໜາ ແລະ ຄວາມເຊື່ອໃນທົ່ວປະເທດ', 0, NULL, 21, NULL, '2017-09-03 18:48:20'),
            (23, 'ຕາຕະລາງເກັບກຳສະຖິຕິະສົງ, ສາມະເນນ, ຄູຄຳສອນ ແລະ', NULL, 'ຕາຕະລາງເກັບກຳສະຖິຕິະສົງ, ສາມະເນນ, ຄູຄຳສອນ ແລະ ຄະນະຮັບຜິດຊອບສາສະໜາ', 0, NULL, 21, NULL, '2017-09-03 18:48:20'),
            (24, 'ຕາຕະລາງເກັບກຳສະຖິຕິສາສະນະສະຖານໃນທົ່ວປະເທດ', NULL, 'ຕາຕະລາງເກັບກຳສະຖິຕິສາສະນະສະຖານໃນທົ່ວປະເທດ', 0, NULL, 21, NULL, '2017-09-03 18:48:20'),
            (25, 'ຕາຕະລາງສັງລວມສະຖິຕິຊົນເຜົ່າໃນທົ່ວແຂວງ', NULL, 'ຕາຕະລາງສັງລວມສະຖິຕິຊົນເຜົ່າໃນທົ່ວແຂວງ', 0, NULL, 21, NULL, '2017-09-03 18:48:20'),
            (26, 'ຕາຕະລາງສັງລວມສະຖິຕິຊົນເຜົ່າໃນທົ່ວເມືອງ', NULL, 'ຕາຕະລາງສັງລວມສະຖິຕິຊົນເຜົ່າໃນທົ່ວເມືອງ', 0, NULL, 21, NULL, '2017-09-03 18:48:21'),
            (27, 'ກົມປະເມີນຜົນ ແລະ ພັດທະນາລັດຖະກອນ', NULL, 'ກົມປະເມີນຜົນ ແລະ ພັດທະນາລັດຖະກອນ', 0, NULL, 0, NULL, '2017-09-03 18:49:19'),
            (28, 'ຕາຕະລາງລາຍງານສະຖິຕິພະນັກງານ-ລັດຖະກອນຂັ້ນກະຊວງ', NULL, 'ຕາຕະລາງລາຍງານສະຖິຕິພະນັກງານ-ລັດຖະກອນຂັ້ນກະຊວງ-ອົງການທຽບເທົ່າ ແລະ ທ້ອງຖິ່ນໄປຝຶກອົບຮົມຢູ່ພາຍໃນ ແລະ ຕ່າງປະເທດ', 0, NULL, 27, NULL, '2017-09-03 18:50:24'),
            (29, 'ຕາຕະລາງສະຖິຕິພະນັກງານ-ລັດຖະກອນຂັ້ນກະຊວງ-ອົງກາ', NULL, 'ຕາຕະລາງສະຖິຕິພະນັກງານ-ລັດຖະກອນຂັ້ນກະຊວງ-ອົງການທຽບເທົ່າ ແລະ ທ້ອງຖິ່ນໄປຍົກລະດັບ (ໄປຮຽນຕໍ່) ຢູ່ພາຍໃນ ແລະ ຕ່າງປະເທດ', 0, NULL, 27, NULL, '2017-09-03 18:50:24'),
            (30, 'ຕາຕະລາງສັງລວມຈຳນວນລັດຖະກອນທີ່ໄປຍົກລະດັບວິຊາສະ', NULL, 'ຕາຕະລາງສັງລວມຈຳນວນລັດຖະກອນທີ່ໄປຍົກລະດັບວິຊາສະເພາະຢູ່ພາຍໃນປະເທດ', 0, NULL, 27, NULL, '2017-09-03 18:50:24'),
            (31, 'ຕາຕະລາງສັງລວມຈຳນວນລັດຖະກອນທີ່ໄປຍົກລະດັບວິຊາສະ', NULL, 'ຕາຕະລາງສັງລວມຈຳນວນລັດຖະກອນທີ່ໄປຍົກລະດັບວິຊາສະເພາະຢູ່ຕ່າງປະເທດ', 0, NULL, 27, NULL, '2017-09-03 18:50:24'),
            (32, 'ຕາຕະລາງສັງລວມຈຳນວນລັດຖະກອນທີ່ໄປຝຶກອົບຮົມຢູ່ພາ', NULL, 'ຕາຕະລາງສັງລວມຈຳນວນລັດຖະກອນທີ່ໄປຝຶກອົບຮົມຢູ່ພາຍໃນປະເທດ', 0, NULL, 27, NULL, '2017-09-03 18:50:24'),
            (33, 'ຕາຕະລາງສັງລວມຈຳນວນລັດຖະກອນທີ່ໄປຝຶກອົບຮົມຢູ່ຕ່', NULL, 'ຕາຕະລາງສັງລວມຈຳນວນລັດຖະກອນທີ່ໄປຝຶກອົບຮົມຢູ່ຕ່າງປະເທດ', 0, NULL, 27, NULL, '2017-09-03 18:50:24'),
            (34, 'ຕາຕະລາງເກັບກຳສະຖິຕິພະນັກງານ-ລັດຖະກອນໄປຝຶກອົບຮ', NULL, 'ຕາຕະລາງເກັບກຳສະຖິຕິພະນັກງານ-ລັດຖະກອນໄປຝຶກອົບຮົມທິດສະດີຢູ່ພາຍໃນປະເທດ', 0, NULL, 27, NULL, '2017-09-03 18:50:24'),
            (35, 'ຕາຕະລາງເກັບກຳສະຖິຕິພະນັກງານ-ລັດຖະກອນໄປຝຶກອົບຮ', NULL, 'ຕາຕະລາງເກັບກຳສະຖິຕິພະນັກງານ-ລັດຖະກອນໄປຝຶກອົບຮົມທິດສະດີຢູ່ຕ່າງປະເທດ', 0, NULL, 27, NULL, '2017-09-03 18:50:24'),
            (36, 'ຕາຕະລາງສັງລວມຈຳນວນລັດຖະກອນທີ່ໄປຝຶກອົບຮົມທິດສະ', NULL, 'ຕາຕະລາງສັງລວມຈຳນວນລັດຖະກອນທີ່ໄປຝຶກອົບຮົມທິດສະດີຢູ່ພາຍໃນປະເທດ', 0, NULL, 27, NULL, '2017-09-03 18:50:24'),
            (37, 'ຕາຕະລາງສັງລວມຈຳນວນລັດຖະກອນທີ່ໄປຝຶກອົບຮົມທິດສະ', NULL, 'ຕາຕະລາງສັງລວມຈຳນວນລັດຖະກອນທີ່ໄປຝຶກອົບຮົມທິດສະດີຢູ່ຕ່າງປະເທດ', 0, NULL, 27, NULL, '2017-09-03 18:50:24'),
            (38, 'ຕາຕະລາງເກັບກຳສະຖິຕິພະນັກງານ-ລັດຖະກອນທີ່ໄປຍົກລ', NULL, 'ຕາຕະລາງເກັບກຳສະຖິຕິພະນັກງານ-ລັດຖະກອນທີ່ໄປຍົກລະດັບວິຊາສະເພາະຢູ່ພາຍໃນປະເທດ (ໄປຮຽນຕໍ່ຊັ້ນໃໝ່)', 0, NULL, 27, NULL, '2017-09-03 18:50:24'),
            (39, 'ຕາຕະລາງເກັບກຳສະຖິຕິພະນັກງານ-ລັດຖະກອນທີ່ໄປຍົກລ', NULL, 'ຕາຕະລາງເກັບກຳສະຖິຕິພະນັກງານ-ລັດຖະກອນທີ່ໄປຍົກລະດັບວິຊາສະເພາະຢູ່ຕ່າງປະເທດ (ໄປຮຽນຕໍ່ຊັ້ນໃໝ່)', 0, NULL, 27, NULL, '2017-09-03 18:50:24'),
            (40, 'ຕາຕະລາງເກັບກຳສະຖິຕິລັດຖະກອນໄປຝຶກອົບຮົມວິຊາສະເ', NULL, 'ຕາຕະລາງເກັບກຳສະຖິຕິລັດຖະກອນໄປຝຶກອົບຮົມວິຊາສະເພາະຢູ່ພາຍໃນປະເທດ', 0, NULL, 27, NULL, '2017-09-03 18:50:24'),
            (41, 'ຕາຕະລາງເກັບກຳສະຖິຕິລັດຖະກອນໄປຝຶກອົບຮົມວິຊາສະເ', NULL, 'ຕາຕະລາງເກັບກຳສະຖິຕິລັດຖະກອນໄປຝຶກອົບຮົມວິຊາສະເພາະຢູ່ຕ່າງປະເທດ', 0, NULL, 27, NULL, '2017-09-03 18:50:24'),
            (42, 'ຕາຕະລາງສັງລວມຈຳນວນລັດຖະກອນທີ່ໄປຍົກລະດັບວິຊາສະ', NULL, 'ຕາຕະລາງສັງລວມຈຳນວນລັດຖະກອນທີ່ໄປຍົກລະດັບວິຊາສະເພາະຢູ່ພາຍໃນປະເທດ', 0, NULL, 27, NULL, '2017-09-03 18:50:24'),
            (43, 'ຕາຕະລາງສັງລວມຈຳນວນລັດຖະກອນທີ່ໄປຍົກລະດັບວິຊາສະ', NULL, 'ຕາຕະລາງສັງລວມຈຳນວນລັດຖະກອນທີ່ໄປຍົກລະດັບວິຊາສະເພາະຢູ່ຕ່າງປະເທດ', 0, NULL, 27, NULL, '2017-09-03 18:50:24'),
            (44, 'ຕາຕະລາງສັງລວມຈຳນວນລັດຖະກອນທີ່ໄປຝຶກອົບຮົມວິຊາສ', NULL, 'ຕາຕະລາງສັງລວມຈຳນວນລັດຖະກອນທີ່ໄປຝຶກອົບຮົມວິຊາສະເພາະຢູ່ພາຍໃນປະເທດ', 0, NULL, 27, NULL, '2017-09-03 18:50:24'),
            (45, 'ຕາຕະລາງສັງລວມຈຳນວນລັດຖະກອນທີ່ໄປຝຶກອົບຮົມວິຊາສ', NULL, 'ຕາຕະລາງສັງລວມຈຳນວນລັດຖະກອນທີ່ໄປຝຶກອົບຮົມວິຊາສະເພາະຢູ່ຕ່າງປະເທດ', 0, NULL, 27, NULL, '2017-09-03 18:50:24'),
            (46, 'ຕາຕະລາງເກັບກຳສະຖິຕິພະນັກງານ-ລັດຖະກອນໄປຝຶກອົບຮ', NULL, 'ຕາຕະລາງເກັບກຳສະຖິຕິພະນັກງານ-ລັດຖະກອນໄປຝຶກອົບຮົມທິດສະດີຢູ່ພາຍໃນປະເທດ', 0, NULL, 27, NULL, '2017-09-03 18:50:25'),
            (47, 'ຕາຕະລາງເກັບກຳສະຖິຕິພະນັກງານ-ລັດຖະກອນໄປຝຶກອົບຮ', NULL, 'ຕາຕະລາງເກັບກຳສະຖິຕິພະນັກງານ-ລັດຖະກອນໄປຝຶກອົບຮົມທິດສະດີຢູ່ຕ່າງປະເທດ', 0, NULL, 27, NULL, '2017-09-03 18:50:25'),
            (48, 'ຕາຕະລາງເກັບກຳສະຖິຕິພະນັກງານ-ລັດຖະກອນທີ່ໄປຍົກລ', NULL, 'ຕາຕະລາງເກັບກຳສະຖິຕິພະນັກງານ-ລັດຖະກອນທີ່ໄປຍົກລະດັບວິຊາສະເພາະຢູ່ພາຍໃນປະເທດ (ໄປຮຽນຕໍ່ຊັ້ນໃໝ່)', 0, NULL, 27, NULL, '2017-09-03 18:50:25'),
            (49, 'ຕາຕະລາງເກັບກຳສະຖິຕິພະນັກງານ-ລັດຖະກອນທີ່ໄປຍົກລ', NULL, 'ຕາຕະລາງເກັບກຳສະຖິຕິພະນັກງານ-ລັດຖະກອນທີ່ໄປຍົກລະດັບວິຊາສະເພາະຢູ່ຕ່າງປະເທດ (ໄປຮຽນຕໍ່ຊັ້ນໃໝ່)', 0, NULL, 27, NULL, '2017-09-03 18:50:25'),
            (50, 'ຕາຕະລາງເກັບກຳສະຖິຕິພະນັກງານ-ລັດຖະກອນໄປຝຶກອົບຮ', NULL, 'ຕາຕະລາງເກັບກຳສະຖິຕິພະນັກງານ-ລັດຖະກອນໄປຝຶກອົບຮົມວິຊາສະເພາະຢູ່ພາຍໃນປະເທດ', 0, NULL, 27, NULL, '2017-09-03 18:50:25'),
            (51, 'ຕາຕະລາງເກັບກຳສະຖິຕິພະນັກງານ-ລັດຖະກອນໄປຝຶກອົບຮ', NULL, 'ຕາຕະລາງເກັບກຳສະຖິຕິພະນັກງານ-ລັດຖະກອນໄປຝຶກອົບຮົມວິຊາສະເພາະຢູ່ຕ່າງປະເທດ', 0, NULL, 27, NULL, '2017-09-03 18:50:25'),
            (52, 'ຕາຕະລາງສັງລວມຈຳນວນລັດຖະກອນທີ່ໄປຝຶກອົບຮົມທິດສະ', NULL, 'ຕາຕະລາງສັງລວມຈຳນວນລັດຖະກອນທີ່ໄປຝຶກອົບຮົມທິດສະດີຢູ່ພາຍໃນປະເທດ', 0, NULL, 27, NULL, '2017-09-03 18:50:25'),
            (53, 'ຕາຕະລາງສັງລວມຈຳນວນລັດຖະກອນທີ່ໄປຝຶກອົບຮົມທິດສະ', NULL, 'ຕາຕະລາງສັງລວມຈຳນວນລັດຖະກອນທີ່ໄປຝຶກອົບຮົມທິດສະດີຢູ່ຕ່າງປະເທດ', 0, NULL, 27, NULL, '2017-09-03 18:50:26'),
            (54, 'ກົມຄຸ້ມຄອງພົນລະເມືອງ', NULL, 'ກົມຄຸ້ມຄອງພົນລະເມືອງ', 0, NULL, 0, NULL, '2017-09-03 18:50:38'),
            (55, 'ຕາຕະລາງສັງລວມສະຖິຕິພົນລະເມືອງລາວທົ່ວປະເທດ', NULL, 'ຕາຕະລາງສັງລວມສະຖິຕິພົນລະເມືອງລາວທົ່ວປະເທດ', 0, NULL, 54, NULL, '2017-09-03 18:51:25'),
            (56, 'ຕາຕະລາງສັງລວມສະຖິຕິພົນລະເມືອງຂອງແຂວງ...... ປະ', NULL, 'ຕາຕະລາງສັງລວມສະຖິຕິພົນລະເມືອງຂອງແຂວງ...... ປະຈໍາປີ.......', 0, NULL, 54, NULL, '2017-09-03 18:51:25'),
            (57, 'ຕາຕະລາງບັນທຶກສະຖິຕິພົນລະເມືອງຂອງແຂວງ....... ປ', NULL, 'ຕາຕະລາງບັນທຶກສະຖິຕິພົນລະເມືອງຂອງແຂວງ....... ປະຈຳປີ.......', 0, NULL, 54, NULL, '2017-09-03 18:51:25'),
            (58, 'ຕາຕະລາງສັງລວມສະຖິຕິພົນລະເມືອງ', NULL, 'ຕາຕະລາງສັງລວມສະຖິຕິພົນລະເມືອງ', 0, NULL, 54, NULL, '2017-09-03 18:51:25'),
            (59, 'ຕາຕະລາງບັນທຶກສະຖິຕິພົນລະເມືອງຂອງເມືອງປະຈຳ 6 ເ', NULL, 'ຕາຕະລາງບັນທຶກສະຖິຕິພົນລະເມືອງຂອງເມືອງປະຈຳ 6 ເດືອນ....... ປະຈຳປີ ............', 0, NULL, 54, NULL, '2017-09-03 18:51:25'),
            (60, 'ຕາຕະລາງສັງລວມສະຖິຕິພົນລະເມືອງຂອງບ້ານປະຈຳງວດ..', NULL, 'ຕາຕະລາງສັງລວມສະຖິຕິພົນລະເມືອງຂອງບ້ານປະຈຳງວດ.......... ປະຈຳປີ .............', 0, NULL, 54, NULL, '2017-09-03 18:51:25'),
            (61, 'ຕາຕະລາງບັນທຶກການເກີດຂອງພົນລະເມືອງຂອງບ້ານ ປະຈຳ', NULL, 'ຕາຕະລາງບັນທຶກການເກີດຂອງພົນລະເມືອງຂອງບ້ານ ປະຈຳວັນ ປະຈຳປີ .............', 0, NULL, 54, NULL, '2017-09-03 18:51:25'),
            (62, 'ຕາຕະລາງບັນທຶກການແຕ່ງດອງຂອງພົນລະເມືອງຂອງບ້ານ ປ', NULL, 'ຕາຕະລາງບັນທຶກການແຕ່ງດອງຂອງພົນລະເມືອງຂອງບ້ານ ປະຈຳວັນ ປະຈໍາປີ ..........', 0, NULL, 54, NULL, '2017-09-03 18:51:25'),
            (63, 'ຕາຕະລາງບັນທຶກການຢ່າຮ້າງຂອງພົນລະເມືອງຂອງບ້ານ ປ', NULL, 'ຕາຕະລາງບັນທຶກການຢ່າຮ້າງຂອງພົນລະເມືອງຂອງບ້ານ ປະຈຳວັນ ປະຈໍາປີ ...........', 0, NULL, 54, NULL, '2017-09-03 18:51:25'),
            (64, 'ຕາຕະລາງບັນທຶກການຍົກຍ້າຍມາຂອງພົນລະເມືອງຂອງບ້ານ', NULL, 'ຕາຕະລາງບັນທຶກການຍົກຍ້າຍມາຂອງພົນລະເມືອງຂອງບ້ານ ປະຈຳວັນ ປະຈຳປີ .......', 0, NULL, 54, NULL, '2017-09-03 18:51:25'),
            (65, 'ຕາຕະລາງບັນທຶກສາເຫດການຍົກຍ້າຍໄປຂອງພົນລະເມືອງຂອ', NULL, 'ຕາຕະລາງບັນທຶກສາເຫດການຍົກຍ້າຍໄປຂອງພົນລະເມືອງຂອງບ້ານ ປະຈຳວັນ ປະຈຳປີ .....', 0, NULL, 54, NULL, '2017-09-03 18:51:25'),
            (66, 'ຕາຕະລາງບັນທຶກສາເຫດານເສຍຊີວິດຂອງພົນລະເມືອງຂອງບ', NULL, 'ຕາຕະລາງບັນທຶກສາເຫດານເສຍຊີວິດຂອງພົນລະເມືອງຂອງບ້ານ ປະຈຳປີ ...........', 0, NULL, 54, NULL, '2017-09-03 18:51:28'),
            (67, 'ກົມການປົກຄອງທ້ອງຖິ່ນ', NULL, 'ກົມການປົກຄອງທ້ອງຖິ່ນ', 0, NULL, 0, NULL, '2017-09-03 18:51:37'),
            (68, 'ລາຍຊື່ຜູ້ດຳລົງຕໍາແໜ່ງເຈົ້າແຂວງ, ຮອງເຈົ້າແຂວງ,', NULL, 'ລາຍຊື່ຜູ້ດຳລົງຕໍາແໜ່ງເຈົ້າແຂວງ, ຮອງເຈົ້າແຂວງ, ເຈົ້າຄອງນະຄອນ ແລະ ຮອງເຈົ້າຄອງນະຄອນ', 0, NULL, 67, NULL, '2017-09-03 18:52:20'),
            (69, 'ລາຍຊື່ຜູ້ດຳລົງຕຳແໜ່ງຫົວໜ້າ ແລະ ຮອງຫົວໜ້າຫ້ອງວ', NULL, 'ລາຍຊື່ຜູ້ດຳລົງຕຳແໜ່ງຫົວໜ້າ ແລະ ຮອງຫົວໜ້າຫ້ອງວ່າການປົກຄອງແຂວງ', 0, NULL, 67, NULL, '2017-09-03 18:52:20'),
            (70, 'ລາຍຊື່ຜູ້ດຳລົງຕຳແໜ່ງຫົວໜ້າ, ຮອງຫົວໜ້າພະແນກ ແລ', NULL, 'ລາຍຊື່ຜູ້ດຳລົງຕຳແໜ່ງຫົວໜ້າ, ຮອງຫົວໜ້າພະແນກ ແລະ ອົງການທຽບເທົ່າ', 0, NULL, 67, NULL, '2017-09-03 18:52:20'),
            (71, 'ຕາຕະລາງສັງລວມຂໍ້ມູນກ່ຽວກັບເມືອງ, ບ້ານ ທົ່ວແຂວ', NULL, 'ຕາຕະລາງສັງລວມຂໍ້ມູນກ່ຽວກັບເມືອງ, ບ້ານ ທົ່ວແຂວງ', 0, NULL, 67, NULL, '2017-09-03 18:52:20'),
            (72, 'ລາຍຊື່ຜູ້ດຳລົງຕຳແໜ່ງເຈົ້າເມືອງ ແລະ ຮອງເຈົ້າເມ', NULL, 'ລາຍຊື່ຜູ້ດຳລົງຕຳແໜ່ງເຈົ້າເມືອງ ແລະ ຮອງເຈົ້າເມືອງ', 0, NULL, 67, NULL, '2017-09-03 18:52:20'),
            (73, 'ລາຍຊື່ຜູ້ລົງຕຳແໜ່ງຫົວໜ້າ ແລະ ຮອງຫົວໜ້າຫ້ອງວ່າ', NULL, 'ລາຍຊື່ຜູ້ລົງຕຳແໜ່ງຫົວໜ້າ ແລະ ຮອງຫົວໜ້າຫ້ອງວ່າການປົຄອງເມືອງ', 0, NULL, 67, NULL, '2017-09-03 18:52:20'),
            (74, 'ລາຍຊື່ຜູ້ດຳລົງຕຳແໜ່ງຫົວໜ້າຫ້ອງການ, ຮອງຫົວໜ້າຫ', NULL, 'ລາຍຊື່ຜູ້ດຳລົງຕຳແໜ່ງຫົວໜ້າຫ້ອງການ, ຮອງຫົວໜ້າຫ້ອງການ ແລະ ອົງການທຽບເທົ່າ', 0, NULL, 67, NULL, '2017-09-03 18:52:20'),
            (75, 'ຕາຕະລາງສັງລວມຂໍ້ມູນກ່ຽວກັບເມືອງ ໃນເຂດຕົວເມືອງ', NULL, 'ຕາຕະລາງສັງລວມຂໍ້ມູນກ່ຽວກັບເມືອງ ໃນເຂດຕົວເມືອງ', 0, NULL, 67, NULL, '2017-09-03 18:52:20'),
            (76, 'ຕາຕະລາງສັງລວມຂໍ້ມູນກ່ຽວກັບເມືອງ ໃນເຂດຊົນນະບົດ', NULL, 'ຕາຕະລາງສັງລວມຂໍ້ມູນກ່ຽວກັບເມືອງ ໃນເຂດຊົນນະບົດ', 0, NULL, 67, NULL, '2017-09-03 18:52:20'),
            (77, 'ຕາຕະລາງສັງລວມຂໍ້ມູນບ້ານເປົ້າໝາຍເຮັດບ້ານສາມສ້າ', NULL, 'ຕາຕະລາງສັງລວມຂໍ້ມູນບ້ານເປົ້າໝາຍເຮັດບ້ານສາມສ້າງ', 0, NULL, 67, NULL, '2017-09-03 18:52:20'),
            (78, 'ຕາຕະລາງສັງລວມຂໍ້ມູນຂັ້ນບ້ານ', NULL, 'ຕາຕະລາງສັງລວມຂໍ້ມູນຂັ້ນບ້ານ', 0, NULL, 67, NULL, '2017-09-03 18:52:21'),
            (79, 'ກົມພັດທະນາການບໍລິຫານລັດ', NULL, 'ກົມພັດທະນາການບໍລິຫານລັດ', 0, NULL, 0, NULL, '2017-09-03 18:52:28'),
            (80, 'ສະຖິຕິກົງຈັກຂອງລັດຖະບານ.... ກະຊວງ ..... ອົງກາ', NULL, 'ສະຖິຕິກົງຈັກຂອງລັດຖະບານ.... ກະຊວງ ..... ອົງການລັດທຽບເທົ່າ', 0, NULL, 79, NULL, '2017-09-03 18:53:04'),
            (81, 'ສະຖິຕິບັນດາຫົວໜ່ວຍການຈັດຕັ້ງ (ກົມ, ສະຖາບັນ, ສ', NULL, 'ສະຖິຕິບັນດາຫົວໜ່ວຍການຈັດຕັ້ງ (ກົມ, ສະຖາບັນ, ສູນ ແລະ ທຽບເທົ່າກົມ)', 0, NULL, 79, NULL, '2017-09-03 18:53:04'),
            (82, 'ສະຖິຕິບັນດານິຕິກຳຂະແໜງພາຍໃນທີ່ກຳລັງປັບປຸງ ແລະ', NULL, 'ສະຖິຕິບັນດານິຕິກຳຂະແໜງພາຍໃນທີ່ກຳລັງປັບປຸງ ແລະ ຮ່າງຂຶ້ນໃໝ່', 0, NULL, 79, NULL, '2017-09-03 18:53:04'),
            (83, 'ສະຖິຕິໜ່ວຍງານຈັດຕັ້ງປະຕິບັດກົນໄກການບໍລິການຜ່າ', NULL, 'ສະຖິຕິໜ່ວຍງານຈັດຕັ້ງປະຕິບັດກົນໄກການບໍລິການຜ່ານປະຕູດຽວ', 0, NULL, 79, NULL, '2017-09-03 18:53:04'),
            (84, 'ສະຖິຕິສະມາຄົມ/ມູນນິທິໃນທົ່ວປະເທດ', NULL, 'ສະຖິຕິສະມາຄົມ/ມູນນິທິໃນທົ່ວປະເທດ', 0, NULL, 79, NULL, '2017-09-03 18:53:04'),
            (85, 'ຮ່າງໂຄງປະກອບກົງຈັກການຈັດຕັ້ງ ແລະ ບຸກຄະລະກອນຂອ', NULL, 'ຮ່າງໂຄງປະກອບກົງຈັກການຈັດຕັ້ງ ແລະ ບຸກຄະລະກອນຂອງກະຊວງ/ອົງການລັດທຽບເທົ່າກະຊວງ', 0, NULL, 79, NULL, '2017-09-03 18:53:05'),
            (86, 'ກົມສຳເນົາເອກະສານແຫ່ງຊາດ', NULL, 'ກົມສຳເນົາເອກະສານແຫ່ງຊາດ', 0, NULL, 0, NULL, '2017-09-03 18:53:18'),
            (87, 'ສະຖິຕິການທ້ອນໂຮມເອກະສານທີ່ມີຄວາມສຳຄັນແຫ່ງຊາດ', NULL, 'ສະຖິຕິການທ້ອນໂຮມເອກະສານທີ່ມີຄວາມສຳຄັນແຫ່ງຊາດ', 0, NULL, 86, NULL, '2017-09-03 18:54:01'),
            (88, 'ສະຖິຕິການທ້ອນໂຮມເອກະສານທີ່ມີຄວາມສຳຄັນແຫ່ງຊາດ', NULL, 'ສະຖິຕິການທ້ອນໂຮມເອກະສານທີ່ມີຄວາມສຳຄັນແຫ່ງຊາດ', 0, NULL, 86, NULL, '2017-09-03 18:54:01'),
            (89, 'ກົມແຜນທີ່ແຫ່ງຊາດ', NULL, 'ກົມແຜນທີ່ແຫ່ງຊາດ', 0, NULL, 0, NULL, '2017-09-03 18:54:01'),
            (90, 'ສະຖິຕິການເຄື່ອນໄຫວວຽກງານສຳຫຼວດປະຈຳປີ ......', NULL, 'ສະຖິຕິການເຄື່ອນໄຫວວຽກງານສຳຫຼວດປະຈຳປີ ......', 0, NULL, 89, NULL, '2017-09-03 18:55:00'),
            (91, 'ສະຖິຕິການບໍລິການແຜນທີ່ມາດຕາສ່ວນ', NULL, 'ສະຖິຕິການບໍລິການແຜນທີ່ມາດຕາສ່ວນ', 0, NULL, 89, NULL, '2017-09-03 18:55:00'),
            (92, 'ສະຖິຕິການຜະລິດແຜນທີ່', NULL, 'ສະຖິຕິການຜະລິດແຜນທີ່', 0, NULL, 89, NULL, '2017-09-03 18:55:00'),
            (93, 'ສູນສຳຫຼວດວັດແທກ ແລະ ແຜນທີ່', NULL, 'ສູນສຳຫຼວດວັດແທກ ແລະ ແຜນທີ່', 0, NULL, 0, NULL, '2017-09-03 18:55:01'),
            (94, 'ສະຖິຕິການສຳຫຼວດວັດແທກ ແລະ ວຽກງານການພິມ', NULL, 'ສະຖິຕິການສຳຫຼວດວັດແທກ ແລະ ວຽກງານການພິມ', 0, NULL, 93, NULL, '2017-09-03 18:55:28'),
            (95, 'ກົມແຂ່ງຂັນ ແລະ ຍ້ອງຍໍ', NULL, 'ກົມແຂ່ງຂັນ ແລະ ຍ້ອງຍໍ', 0, NULL, 0, NULL, '2017-09-03 18:55:29'),
            (96, 'ຕາຕະລາງປະເພດຫຼຽນກາ ສໍາລັບຍ້ອງຍໍພາຍໃນກະຊວງ, ອົ', NULL, 'ຕາຕະລາງປະເພດຫຼຽນກາ ສໍາລັບຍ້ອງຍໍພາຍໃນກະຊວງ, ອົງການ', 0, NULL, 95, NULL, '2017-09-03 19:00:16'),
            (97, 'ຕາຕະລາງປະເພດຫຼຽນໄຊຕ່າງໆ ສໍາລັບຍ້ອງຍໍພາຍໃນກະຊວ', NULL, 'ຕາຕະລາງປະເພດຫຼຽນໄຊຕ່າງໆ ສໍາລັບຍ້ອງຍໍພາຍໃນກະຊວງ, ອົງການ', 0, NULL, 95, NULL, '2017-09-03 19:00:16'),
            (98, 'ຕາຕະລາງປະເພດຫຼຽນຊັ້ນສູງ ສຳລັບການຍ້ອງຍໍພາຍໃນຂອ', NULL, 'ຕາຕະລາງປະເພດຫຼຽນຊັ້ນສູງ ສຳລັບການຍ້ອງຍໍພາຍໃນຂອງບັນດາກະຊວງ, ອົງການ', 0, NULL, 95, NULL, '2017-09-03 19:00:16'),
            (99, 'ຕາຕະລາງປະເພດຫຼຽນໄຊຕ່າງໆ ສຳລັບຍ້ອງຍໍພາຍໃນຂອງບັ', NULL, 'ຕາຕະລາງປະເພດຫຼຽນໄຊຕ່າງໆ ສຳລັບຍ້ອງຍໍພາຍໃນຂອງບັນດາແຂວງ, ນະຄອນຫຼວງ', 0, NULL, 95, NULL, '2017-09-03 19:00:16'),
            (100, 'ຕາຕະລາງປະເພດຫຼຽນກາ ສຳລັບຍ້ອງຍໍພາຍໃນຂອງບັນດາແຂ', NULL, 'ຕາຕະລາງປະເພດຫຼຽນກາ ສຳລັບຍ້ອງຍໍພາຍໃນຂອງບັນດາແຂວງ, ນະຄອນຫຼວງ', 0, NULL, 95, NULL, '2017-09-03 19:00:16'),
            (101, 'ຕາຕະລາງປະເພດຫຼຽນຊັ້ນສູງ ສຳລັບການຍ້ອງຍໍສາກົນຂອ', NULL, 'ຕາຕະລາງປະເພດຫຼຽນຊັ້ນສູງ ສຳລັບການຍ້ອງຍໍສາກົນຂອງບັນດາກະຊວງ, ອົງການ', 0, NULL, 95, NULL, '2017-09-03 19:00:16'),
            (102, 'ຕາຕະລາງປະເພດຫຼຽນໄຊຕ່າງໆ ສຳລັບຍ້ອງຍໍສາກົນຂອງບັ', NULL, 'ຕາຕະລາງປະເພດຫຼຽນໄຊຕ່າງໆ ສຳລັບຍ້ອງຍໍສາກົນຂອງບັນດາກະຊວງ, ອົງການ', 0, NULL, 95, NULL, '2017-09-03 19:00:16'),
            (103, 'ຕາຕະລາງປະເພດຫຼຽນໄຊຕ່າງໆ ສຳລັບຍ້ອງຍໍສາກົນ ຂອງບ', NULL, 'ຕາຕະລາງປະເພດຫຼຽນໄຊຕ່າງໆ ສຳລັບຍ້ອງຍໍສາກົນ ຂອງບັນດາແຂວງ, ນະຄອນຫຼວງວຽງຈັນ', 0, NULL, 95, NULL, '2017-09-03 19:00:16'),
            (104, 'ຕາຕະລາງປະເພດຫຼຽນກາ ສຳລັບຍ້ອງຍໍສາກົນຂອງບັນດາກະ', NULL, 'ຕາຕະລາງປະເພດຫຼຽນກາ ສຳລັບຍ້ອງຍໍສາກົນຂອງບັນດາກະຊວງ, ອົງການ', 0, NULL, 95, NULL, '2017-09-03 19:00:16'),
            (105, 'ຕາຕະລາງປະເພດຫຼຽນກາ ສຳລັບຍ້ອງຍໍສາກົນຂອງບັນດາແຂ', NULL, 'ຕາຕະລາງປະເພດຫຼຽນກາ ສຳລັບຍ້ອງຍໍສາກົນຂອງບັນດາແຂວງ, ນະຄອນຫຼວງວຽງຈັນ', 0, NULL, 95, NULL, '2017-09-03 19:00:16'),
            (106, 'ກົມແຜນການ ແລະ ການຮ່ວມມື', NULL, 'ກົມແຜນການ ແລະ ການຮ່ວມມື', 0, NULL, 0, NULL, '2017-09-03 19:00:17'),
            (107, 'ຕາຕະລາງບັນຊີໂຄງການຊ່ວຍເຫຼືອທາງການເພື່ອການພັດທ', NULL, 'ຕາຕະລາງບັນຊີໂຄງການຊ່ວຍເຫຼືອທາງການເພື່ອການພັດທະນາ (ODA)', 0, NULL, 106, NULL, '2017-09-03 19:01:11'),
            (108, 'ຕາຕະລາງສະຖິຕິການຮ່ວມມື', NULL, 'ຕາຕະລາງສະຖິຕິການຮ່ວມມື', 0, NULL, 106, NULL, '2017-09-03 19:01:11'),
            (109, 'ກົມຄຸ້ມຄອງລັດຖະກອນ', NULL, 'ກົມຄຸ້ມຄອງລັດຖະກອນ', 0, NULL, 0, NULL, '2017-09-03 19:01:13'),
            (110, 'ຕາຕະລາງສັງລວມຈຳນວນພະນັກງານ ແຍກຕາມຊັ້ນ-ຂັ້ນເງິ', NULL, 'ຕາຕະລາງສັງລວມຈຳນວນພະນັກງານ ແຍກຕາມຊັ້ນ-ຂັ້ນເງິນເດືອນ (ສະເພາະຊັ້ນ VI)', 0, NULL, 109, NULL, '2017-09-03 19:05:41'),
            (111, 'ຕາຕະລາງສັງລວມຈຳນວນລັດຖະກອນແຍກຕາມຊັ້ນ-ຂັ້ນເງິນ', NULL, 'ຕາຕະລາງສັງລວມຈຳນວນລັດຖະກອນແຍກຕາມຊັ້ນ-ຂັ້ນເງິນເດືອນ (ແຕ່ຊັ້ນ I-V)', 0, NULL, 109, NULL, '2017-09-03 19:06:06'),
            (112, 'ຕາຕະລາງສັງລວມຈຳນວນລັດຖະກອນແຍກຕາມວິຊາສະເພາະ', NULL, 'ຕາຕະລາງສັງລວມຈຳນວນລັດຖະກອນແຍກຕາມວິຊາສະເພາະ', 0, NULL, 109, NULL, '2017-09-03 19:10:17'),
            (113, 'ຕາຕະລາງສັງລວມລັດຖະກອນແຍກຕາມເກນອາຍຸ', NULL, 'ຕາຕະລາງສັງລວມລັດຖະກອນແຍກຕາມເກນອາຍຸ', 0, NULL, 109, NULL, '2017-09-03 19:10:17'),
            (114, 'ຕາຕະລາງສັງລວມລັດຖະກອນແຍກຕາມຊົນເຜົ່າ', NULL, 'ຕາຕະລາງສັງລວມລັດຖະກອນແຍກຕາມຊົນເຜົ່າ', 0, NULL, 109, NULL, '2017-09-03 19:10:17'),
            (115, 'ຕາຕະລາງສັງລວມລັດຖະກອນແຍກຕາມຕຳແໜ່ງບໍລິຫານ', NULL, 'ຕາຕະລາງສັງລວມລັດຖະກອນແຍກຕາມຕຳແໜ່ງບໍລິຫານ', 0, NULL, 109, NULL, '2017-09-03 19:10:17'),
            (116, 'ຕາຕະລາງສັງລວມຈຳນວນລັດຖະກອນທີ່ເຂົ້າເພີ່ມໃນຮູບກ', NULL, 'ຕາຕະລາງສັງລວມຈຳນວນລັດຖະກອນທີ່ເຂົ້າເພີ່ມໃນຮູບການຕ່າງໆ', 0, NULL, 109, NULL, '2017-09-03 19:10:17'),
            (117, 'ຕາຕະລາງສັງລວມຈຳນວນລັດຖະກອນທີ່ອອກພີ່ມໃນຮູບການຕ', NULL, 'ຕາຕະລາງສັງລວມຈຳນວນລັດຖະກອນທີ່ອອກພີ່ມໃນຮູບການຕ່າງໆ', 0, NULL, 109, NULL, '2017-09-03 19:10:17'),
            (118, 'ຕາຕະລາງສັງລວມຈຳນວນພະນັກງານຕາມສັນຍາ', NULL, 'ຕາຕະລາງສັງລວມຈຳນວນພະນັກງານຕາມສັນຍາ', 0, NULL, 109, NULL, '2017-09-03 19:10:17'),
            (119, 'ຕາຕະລາງຈຳນວນລັດຖະກອນທີ່ມີເງື່ອນໄຂຮັບບຳນານ', NULL, 'ຕາຕະລາງຈຳນວນລັດຖະກອນທີ່ມີເງື່ອນໄຂຮັບບຳນານ', 0, NULL, 109, NULL, '2017-09-03 19:10:18');
            
           
     
            
            
            
            set foreign_key_checks=1;
            ";
        $this->execute($sql);
    }
    

    public function safeDown()
    {
        $sql = "
            set foreign_key_checks=0;
            DROP TABLE IF EXISTS `menu`;
           
            
            DROP TABLE IF EXISTS `menugroup`;
            
            set foreign_key_checks=1;
            ";
        $this->execute($sql);
    }
}
